reproducibilityPackages/openfoam/snappyHexMesh/Re2000AoA30/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version 2.0;
  format  ascii;
  class   volVectorField;
  object  U;
}

//****************************************************************************//

dimensions [0 1 -1 0 0 0 0];

internalField uniform (1.0 0.0 0.0);

boundaryField
{
  snake
  {
    type  fixedValue;
    value uniform (0.0 0.0 0.0);    
  }
  
  inlet
  {
    type  fixedValue;
    value uniform (1.0 0.0 0.0);
  }
  
  outlet
  {
    type advective;
  }
  
  bottom
  {
    type symmetryPlane;
  }
  
  top
  {
    type symmetryPlane;
  }
  
  front
  {
    type empty;
  }
  
  back
  {
    type empty;
  }
  
  defaultFaces
  {
    type empty;
  }
}

//****************************************************************************//